---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
SlabShapeCrease Properties
SlabShapeCrease Class See Also Send Feedback
---

The SlabShapeCrease type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | CreaseType | The type of the crease. |
|  | Curve | The geometry of the crease. |
|  | EndPoints | The vertices of the crease. |

# See Also

SlabShapeCrease Class

Autodesk.Revit.DB Namespace